import csv
import json

renmae_maping = {
   "TabContainer":"底部分頁容器",
   "PagerContainer":"頁籤分頁容器",
   "NoTitlePagerContainer":"分頁容器",
   "StaticPageContainer":"靜態容器",
   "ScrollPageContainer":"垂直捲動容器",
   "自選股":"自選股",
   "自選股/編輯":"自選股/編輯",
   "自選股/搜尋":"自選股/搜尋",
   "工具列":"標題導覽列",
   "個股/工具列":"個股導覽列",
   "自選股/工具列":"自選股導覽列",
   "策略/工具列":"策略導覽列",
   "類股/工具列":"類股導覽列",
   "社團/工具列":"社團導覽列",
   "看板聊天室工具列":"聊天室導覽列",
   "圖片/工具列":"圖片導覽列",
   "內容專區/工具列":"內容專區導覽列",
   "分點/工具列":"券商分點導覽列",
   "選股/篩選條件":"篩選列",
   "選股/單一策略":"合併表格",
   "選股/篩選":"篩選頁",
   "類股/類股報價_大盤":"類股報價",
   "類股/走勢-小":"類股走勢圖表",
   "類股列表":"類股漲跌列表",
   "類股/個股列表":"類股相關個股表",
   "指數/指數切換":"指數切換工具列",
   "資訊展示/即時資訊組":"資訊展示/即時資訊組",
   "資訊展示/股票報價_大盤":"大盤報價",
   "資訊展示/兩個指數":"資訊展示/兩個指數",
   "資訊展示/三個指數":"資訊展示/三個指數",
   "趨勢圖標題/加權/台指":"趨勢圖標題/加權/台指",
   "趨勢圖標題/加權/櫃買/台指":"趨勢圖標題/加權/櫃買/台指",
   "大盤/走勢-大-加權":"大盤/走勢-大-加權",
   "大盤/走勢-大-加權-期貨":"大盤/走勢-大-加權-期貨",
   "大盤/走勢-大-加權-櫃買":"大盤/走勢-大-加權-櫃買",
   "大盤/走勢-大-加權-櫃買-期貨":"大盤/走勢-大-加權-櫃買-期貨",
   "大盤/K線圖表":"大盤K線圖表",
   "大盤/K線副圖":"大盤K線副圖",
   "大盤/頁籤切換_K線副圖":"大盤K線副圖切換工具列",
   "大盤/頁籤切換_K線":"大盤K線切換工具列",
   "大盤/K線_設定頁面":"大盤K線設定頁",
   "大盤/討論頁":"大盤討論頁",
   "國際股市":"國際股市表",
   "股市自訂資訊展示板":"資訊展示板",
   "個股/檔頭":"個股檔頭",
   "個股/走勢":"個股走勢",
   "個股/分時明細":"個股分時明細",
   "個股/最佳五檔":"個股最佳五檔",
   "個股/新聞":"個股新聞",
   "個股/基本資訊":"個股基本資訊",
   "個股/頁籤切換_K線":"個股K線切換工具列",
   "個股/K線圖表":"個股K線圖表",
   "個股/K線副圖":"個股K線副圖",
   "個股/頁籤切換_K線副圖":"個股K線副圖切換工具列",
   "個股/K線_設定頁面":"個股K線設定頁",
   "個股/討論頁":"個股討論頁",
   "個股/資訊看板":"資訊表格",
   "個股/Bar_Line_圖表":"Bar_Line_圖表",
   "個股/Bar_Line_圖例":"Bar_Line_圖例",
   "擴增表格":"擴增表格",
   "分段控制器":"單層頁面控制器",
   "多分段控制器":"多層頁面控制器",
   "帶標分段控制器":"帶標頁面控制器",
   "流水牆":"流水牆",
   "個股/流水牆":"個股流水牆",
   "作者/列表頁":"blueprint列表",
   "作者/啟動頁":"啟動頁",
   "更多/列表項目":"基本列",
   "更多/新手導覽":"新手導覽列",
   "更多/策略使用":"策略使用列",
   "更多/線上客服":"線上客服列",
   "更多/App評分":"App評分列",
   "更多/分享好友":"分享好友列",
   "更多/用戶資訊":"用戶資訊列",
   "更多/系統設定":"系統設定列",
   "更多/用戶識別碼":"用戶識別碼列",
   "更多/修改暱稱":"編輯暱稱頁",
   "更多/用戶設定":"用戶設定頁",
   "CMoneyFooter":"產品資訊",
   "系統設定/帳號管理":"帳號管理列",
   "系統設定/螢幕恆亮":"螢幕恆亮列",
   "系統設定/服務條款":"服務條款列",
   "系統設定/隱私權政策":"隱私權政策列",
   "系統設定/著作權政策":"著作權政策列",
   "系統設定/登出":"登出列",
   "系統設定/刪除帳號":"刪除帳號列",
   "系統設定/刪除帳號/詳細頁":"刪除帳號頁",
   "跳轉頁面":"跳轉頁",
   "首登流程":"首登流程",
   "選股/跑馬燈-公告":"跑馬燈",
   "CMoney自動登入WebView":"CMoney自動登入WebView",
   "新手導覽":"新手導覽",
   "試用彈窗":"試用彈窗",
   "行銷彈窗":"行銷彈窗",
   "App內購頁面":"購買頁",
   "策略說明":"策略使用時機頁",
   "可折疊資訊卡片":"可折疊資訊卡片",
   "看板聊天室列表":"社團聊天室列表",
   "看板聊天室":"社團聊天室",
   "作者/Po文通知":"通知頁",
   "社團/看板文章":"社團專區",
   "作者專區/社團/看板/全文頁":"作者專區/看板全文頁",
   "作者專區/社團/看板/發文頁":"作者專區/看板發文頁",
   "作者專區/社團/看板/文章編輯頁":"發文編輯頁",
   "內容牆/作者發文":"作者專區",
   "內容牆/專欄文章":"專欄專區",
   "作者專區/專欄/全文頁":"專欄全文頁",
   "作者專區/社團/看板/文章編輯/股票標籤搜尋頁":"個股標籤搜尋",
   "圖片瀏覽頁":"圖片頁",
   "作者專區/社團/看板/文章編輯/圖片詳細頁":"圖片編輯頁",
   "內容專區/內容模板":"內容專區模板",
   "內容專區/文章內頁":"內容專區/文章",
   "內容專區/影音內頁":"內容專區/影音",
   "新增到價條件頁":"新增到價條件頁",
   "編輯到價條件頁":"編輯到價條件頁",
   "到價條件列表":"到價條件列表",
   "到價通知列表":"到價通知列表",
   "大盤/走勢-大-加權-櫃買-期貨-漲跌幅":"大盤/走勢-大-加權-櫃買-期貨-漲跌幅",
   "作者/設定頁":"Allinone設定頁"
}


class Rename:
    def __init__(self, rename_schema: str):
        self.rename_map = renmae_maping
        # # Read the mapping from the CSV file
        # with open(rename_schema, "r") as file:
        #     reader = csv.reader(file)
        #     next(reader)  # Skip the header
        #     for row in reader:
        #         self.rename_map[row[1]] = row[2]

    def run(self, bleuprint: dict) -> dict:
        # Rename the components
        self.find_and_update_subcomponents(bleuprint['pages'])
        return bleuprint


    def find_and_update_subcomponents(self, subcomponents):
        for component in subcomponents:
            if component.get('name') in self.rename_map.keys():
                component['name'] = self.rename_map[component['name']]
            
            # Recursively search in nested subcomponents
            if 'subComponents' in component:
                self.find_and_update_subcomponents(component['subComponents'])

